import time

from func_second import *


size = 10
accuracy = 0.0001


x_0 = np.array([0.5, 0.5, 1.5, -1, -0.5, 1.5, 0.5, -0.5, 1.5, -1.5])
print("☰☰☰Начальное приближение x[0]☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰")
print(str(x_0))
x, i, u, d = newton_method(func, jacobian, x_0, size, accuracy)
print("☰☰☰Реализация метода Ньютона☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰")
print("☰☰☰Решение☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", x)
print("☰☰☰Операций проделано☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", u)
print("☰☰☰Количество итераций☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", i)
print("☰☰☰Время работы☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", d)
print("☰☰☰Проверка решения подстановкой☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", func(x))
print(" ")

x, i, u, d = modified_newton_method(func, jacobian, x_0, size, accuracy)
print("☰☰☰Реализация модифицированного метода Ньютона☰☰☰☰☰☰☰☰☰☰☰☰☰")
print("☰☰☰Решение☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", x)
print("☰☰☰Операций проделано☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", u)
print("☰☰☰Количество итераций☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", i)
print("☰☰☰Время работы☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", d)
print("☰☰☰Проверка решения подстановкой☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", func(x))
print(" ")
k = 2
x, i, u, d = newton_method_with_change(func, jacobian, x_0, size, k, accuracy)
print("☰☰☰Реализация метода Ньютона с переходом на модифицированный после k-той итерации)☰☰☰")
print("☰☰☰Решение☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", x)
print("☰☰☰Операций проделано☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", u)
print("☰☰☰Количество итераций☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", i)
print("☰☰☰Время работы☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", d)
print("☰☰☰Проверка решения подстановкой☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", func(x))
print(" ")
p = 5
x, i, u, d = newton_method_with_period(func, jacobian, x_0, size, p, accuracy)
print("☰☰☰Реализация метода Ньютона с подсчетом якобиана каждые P итераций☰☰☰")
print("☰☰☰Решение☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", x)
print("☰☰☰Операций проделано☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", u)
print("☰☰☰Количество итераций☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", i)
print("☰☰☰Время работы☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", d)
print("☰☰☰Проверка решения подстановкой☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", func(x))
print(" ")

# Изменим одну координату изначального вектора приближений
x_0 = np.array([0.5, 0.5, 1.5, -1, -0.2, 1.5, 0.5, -0.5, 1.5, -1.5])
print("☰☰☰Новое начальное приближение x[0]☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰")
print(str(x_0))
x, i, u, d = newton_method(func, jacobian, x_0, size, accuracy)
print("☰☰☰Реализация метода Ньютона☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰")
print("☰☰☰Решение☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", x)
print("☰☰☰Операций проделано☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", u)
print("☰☰☰Количество итераций☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", i)
print("☰☰☰Время работы☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", d)
print("☰☰☰Проверка решения подстановкой☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", func(x))
print(" ")
print("☰☰☰Модифицированный Метод Ньюьона расходится☰☰☰☰☰☰☰☰☰☰☰☰☰☰")
print(" ")

# Рассмотрим теперь переход Модифицированный Метод Ньюьона (после к-ой итерации) с разными k из посл.пункта
# Метод реализован так, что 0-я итерация в реализации -> 1 итерация в методе, так что рассмотрим k = k-1 = 6
# При k < 6 метод расходится, поэтому вывод не делаю. При К >= 6 метод работтает. Вывод представлен.
k = 6
x, i, u, d = newton_method_with_change(func, jacobian, x_0, size, k, accuracy)
print("☰☰☰Реализация метода Ньютона с переходом на модифицированный после k-той итерации")
print("☰☰☰Решение☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", x)
print("☰☰☰Операций проделано☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", u)
print("☰☰☰Количество итераций☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", i)
print("☰☰☰Время работы☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", d)
print("☰☰☰Проверка решения подстановкой☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", func(x))
p = 5
x, i, u, d = newton_method_with_period(func, jacobian, x_0, size, p, accuracy)
print("☰☰☰Реализация метода Ньютона с подсчетом якобиана каждые P итераций☰☰☰")
print("☰☰☰Решение☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", x)
print("☰☰☰Операций проделано☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", u)
print("☰☰☰Количество итераций☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", i)
print("☰☰☰Время работы☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", d)
print("☰☰☰Проверка решения подстановкой☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰☰" + "\n", func(x))
print(" ")
